lib/shipment-create.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthHeader xmlns="https://www.xend.com.ph/api/">
      <UserToken>A80FF2CB-9523-4184-9C0C-F38707353241</UserToken>
    </AuthHeader>
  </soap:Header>
  <soap:Body>
    <Create xmlns="https://www.xend.com.ph/api/">
      <shipment>
        <ServiceTypeValue>MetroManilaExpress</ServiceTypeValue>
        <ShipmentTypeValue>Parcel</ShipmentTypeValue>
        <PurposeOfExportValue>None</PurposeOfExportValue>
        <CountryManufactured>Philippines</CountryManufactured>
        <Weight>0.50</Weight>
        <DimensionL>0.00</DimensionL>
        <DimensionW>0.00</DimensionW>
        <DimensionH>0.00</DimensionH>
        <DeclaredValue>500</DeclaredValue>
        <RecipientName>Jon Bon Jovi</RecipientName>
        <RecipientCompanyName>Music Company</RecipientCompanyName>
        <RecipientAddress1>1821 Mangghan Street</RecipientAddress1>
        <RecipientCity>Quezon City</RecipientCity>
        <RecipientProvince>Metro Manila</RecipientProvince>
        <RecipientPostalCode>1111</RecipientPostalCode>
        <RecipientCountry>Philippines</RecipientCountry>
        <IsInsured>false</IsInsured>
      </shipment>
    </Create>
  </soap:Body>
</soap:Envelope>